MikroElektronika/core_packages/PIC/XC8/def/PIC16C924/mcu.h
extern volatile LCDD04bits_t LCDD04bits __at(0x114);
// bitfield macros
#define _LCDD04_SEG00_POSN                                  0x0
#define _LCDD04_SEG00_POSITION                              0x0
#define _LCDD04_SEG00_SIZE                                  0x1
#define _LCDD04_SEG00_LENGTH                                0x1
#define _LCDD04_SEG00_MASK                                  0x1
#define _LCDD04_SEG01_POSN                                  0x1
#define _LCDD04_SEG01_POSITION                              0x1
#define _LCDD04_SEG01_SIZE                                  0x1
#define _LCDD04_SEG01_LENGTH                                0x1
#define _LCDD04_SEG01_MASK                                  0x2
#define _LCDD04_SEG02_POSN                                  0x2
#define _LCDD04_SEG02_POSITION                              0x2
#define _LCDD04_SEG02_SIZE                                  0x1
#define _LCDD04_SEG02_LENGTH                                0x1
#define _LCDD04_SEG02_MASK                                  0x4
#define _LCDD04_SEG03_POSN                                  0x3
#define _LCDD04_SEG03_POSITION                              0x3
#define _LCDD04_SEG03_SIZE                                  0x1
#define _LCDD04_SEG03_LENGTH                                0x1
#define _LCDD04_SEG03_MASK                                  0x8
#define _LCDD04_SEG04_POSN                                  0x4
#define _LCDD04_SEG04_POSITION                              0x4
#define _LCDD04_SEG04_SIZE                                  0x1
#define _LCDD04_SEG04_LENGTH                                0x1
#define _LCDD04_SEG04_MASK                                  0x10
#define _LCDD04_SEG05_POSN                                  0x5
#define _LCDD04_SEG05_POSITION                              0x5
#define _LCDD04_SEG05_SIZE                                  0x1
#define _LCDD04_SEG05_LENGTH                                0x1
#define _LCDD04_SEG05_MASK                                  0x20
#define _LCDD04_SEG06_POSN                                  0x6
#define _LCDD04_SEG06_POSITION                              0x6
#define _LCDD04_SEG06_SIZE                                  0x1
#define _LCDD04_SEG06_LENGTH                                0x1
#define _LCDD04_SEG06_MASK                                  0x40
#define _LCDD04_SEG07_POSN                                  0x7
#define _LCDD04_SEG07_POSITION                              0x7
#define _LCDD04_SEG07_SIZE                                  0x1
#define _LCDD04_SEG07_LENGTH                                0x1
#define _LCDD04_SEG07_MASK                                  0x80

// Register: LCDD05
#define LCDD05 LCDD05
extern volatile unsigned char           LCDD05              __at(0x115);
#ifndef _LIB_BUILD
asm("LCDD05 equ 0115h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG08                  :1;
        unsigned SEG09                  :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
} LCDD05bits_t;
extern volatile LCDD05bits_t LCDD05bits __at(0x115);
// bitfield macros
#define _LCDD05_SEG08_POSN                                  0x0
#define _LCDD05_SEG08_POSITION                              0x0
#define _LCDD05_SEG08_SIZE                                  0x1
#define _LCDD05_SEG08_LENGTH                                0x1
#define _LCDD05_SEG08_MASK                                  0x1
#define _LCDD05_SEG09_POSN                                  0x1
#define _LCDD05_SEG09_POSITION                              0x1
#define _LCDD05_SEG09_SIZE                                  0x1
#define _LCDD05_SEG09_LENGTH                                0x1
#define _LCDD05_SEG09_MASK                                  0x2
#define _LCDD05_SEG10_POSN                                  0x2
#define _LCDD05_SEG10_POSITION                              0x2
#define _LCDD05_SEG10_SIZE                                  0x1
#define _LCDD05_SEG10_LENGTH                                0x1
#define _LCDD05_SEG10_MASK                                  0x4
#define _LCDD05_SEG11_POSN                                  0x3
#define _LCDD05_SEG11_POSITION                              0x3
#define _LCDD05_SEG11_SIZE                                  0x1
#define _LCDD05_SEG11_LENGTH                                0x1
#define _LCDD05_SEG11_MASK                                  0x8
#define _LCDD05_SEG12_POSN                                  0x4
#define _LCDD05_SEG12_POSITION                              0x4
#define _LCDD05_SEG12_SIZE                                  0x1
#define _LCDD05_SEG12_LENGTH                                0x1
#define _LCDD05_SEG12_MASK                                  0x10
#define _LCDD05_SEG13_POSN                                  0x5
#define _LCDD05_SEG13_POSITION                              0x5
#define _LCDD05_SEG13_SIZE                                  0x1
#define _LCDD05_SEG13_LENGTH                                0x1
#define _LCDD05_SEG13_MASK                                  0x20
#define _LCDD05_SEG14_POSN                                  0x6
#define _LCDD05_SEG14_POSITION                              0x6
#define _LCDD05_SEG14_SIZE                                  0x1
#define _LCDD05_SEG14_LENGTH                                0x1
#define _LCDD05_SEG14_MASK                                  0x40
#define _LCDD05_SEG15_POSN                                  0x7
#define _LCDD05_SEG15_POSITION                              0x7
#define _LCDD05_SEG15_SIZE                                  0x1
#define _LCDD05_SEG15_LENGTH                                0x1
#define _LCDD05_SEG15_MASK                                  0x80

// Register: LCDD06
#define LCDD06 LCDD06
extern volatile unsigned char           LCDD06              __at(0x116);
#ifndef _LIB_BUILD
asm("LCDD06 equ 0116h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
} LCDD06bits_t;
